app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "name", "certification", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["username", ""], ["password", ""], ["name", ""], ["certification", ""], ["country", ""], ["created_at", "2019-07-08 22:43:32.877934"], ["updated_at", "2019-07-08 22:43:32.877934"]]
---
  def create
    @user = User.new(user_params)
    if @user.save && user_params[:password] == user_params[:password_confirmation]